change from plantuml to mermaid for c4 diagram
